   /* Демонстрация фибоначчиева поиска индекса заданного */
   /* элемента одномерного упорядоченного по возрастанию */
   /* числового массива                                  */
   /* (н е р е к у р с и в н ы й  вариант)               */
   /* -------------------------------------------------- */
   #include<stdio.h>
   #include<conio.h>
   #define N 7         /* Количество элементов в массиве */
      long fib (long);
  /* --------------- */
   int main()
   {
      int a[N],   /* Исходный массив                       */
          x,      /* Искомый элемент                       */
          finish, /* Флаг: 0 - элемент найден              */
          i,      /* Параметр цикла                        */
          f1,f2,  /* Элементы последовательности Фибоначчи */
          t,      /* Вспомогательная переменная            */
          mid,
          b[N];   /* Вспомогательный массив  для  хранения */
                  /* чисел Фибоначчи                       */
      /* ------------------------------------------------- */
      printf("Введите массив из %u элементов, ",N);
      printf("упорядоченный по возрастанию:\n");
      for (i=0; i<N; i++)
        scanf("%u",&a[i]);
      printf("Введённый массив: ");
      for (i=0; i<N; i++)
        printf("%u ",a[i]);
      printf("\nИскомый элемент: "); scanf("%u",&x);
      /* ---------------------------------------- */
      for (i=1,b[1]=1; (b[i]=fib(i))<N+1; i++)
        ;
      mid=N-b[i-2]+1; f1=b[i-2]; f2=b[i-3];
      finish=0;
      while (x!=a[mid-1] && !finish)
        if (mid<=0 || x>a[mid-1])
          if (f1==1)
            finish=1;
          else {
                 mid=mid+f2; f1=f1-f2; f2=f2-f1;
               }
        else if (f2==0)
               finish=1;
             else {
                    mid=mid-f2; t=f1-f2; f1=f2; f2=t;
                  }
      if (!finish)
        printf("Элемент найден; его номер: %u\n",mid-1);
      else printf("Элемент не найден.\n");
      getch();
      return 0;
   }
  /* ------------ */
   long fib(long x)
   /* Нерекурсивная функция  для  вычисления  n-го элемента */
   /* последовательности Фибоначчи с использованием массива */
   /* ----------------------------------------------------- */
   {
      long i,a[3];
      /* ------ */
      if (x<3)
        return 1;
      a[1]=a[0]=1;
      for (i=2; i<x; ++i)
      {
        a[2]=a[0]+a[1]; a[0]=a[1]; a[1]=a[2];
      }
      return a[2];
   }
