   /* Демонстрация линейного поиска  с "барьером"  */
   /* наименьшего индекса заданного элемента одно- */
   /* мерного "случайного" числового массива       */
   /* -------------------------------------------- */
   #include<stdio.h>
   #include<stdlib.h>
   #include<conio.h>
   #include<time.h>
   #define N 10       /* Количество элементов в массиве */
  /* -------------------------------------------------- */
   int main()
   {
      unsigned i,       /* Параметр цикла  */
               a[N+1];  /* Исходный массив */
      /* ------------------------------------------------ */
      printf("Введите натуральное число: "); scanf("%u",&i);
      srand(i?i:time(NULL));
      printf("Исходный массив: ");
      for (i=0;i<N;i++)
        printf("%u ",a[i]=rand()%10);
      /* ------------------------------------------- */
      /*          Суть поиска с "барьером"           */
      /* ------------------------------------------- */
      printf("\nИскомый элемент: "); scanf("%u",&a[N]);         
      i=0;
      while (a[i++]!=a[N]);
      if (i!=N+1)
      {
        printf("Элемент найден; впервые он встречается в\n");
        printf("массиве под номером %u\n",i-1);
      }
      else printf("Элемент не найден.\n");
      getch();
      return 0;
   }
