   /* Демонстрация линейного поиска наименьшего индекса  */
   /* заданного элемента одномерного "случайного" число- */
   /* вого массива                                       */
   /* -------------------------------------------------- */
   #include<stdio.h>
   #include<stdlib.h>
   #include<conio.h>
   #include<time.h>
   #define N 10      /* Количество элементов в массиве   */
  /* --------------------------------------------------- */
   int main()
   {
      unsigned i,     /* Параметр циклов                  */
               a[N],  /* Исходный массив                  */
               x;     /* Искомый элемент                  */
      /* ------------------------------------------------ */
      printf("Введите натуральное число: "); scanf("%u",&i);
      srand(i?i:time(NULL));
      printf("Исходный массив: ");
      for (i=0;i<N;i++)
        printf("%u ",a[i]=rand()%10);
      printf("\nИскомый элемент: "); scanf("%u",&x);
      i=0;
      while (x!=a[i]&&++i<N);
      if (i!=N)
      {
        printf("Элемент найден; впервые он встречается в массиве\n");
        printf("под номером %u\n",i);
      }
      else printf("Элемент в массиве отсутствует.\n");
      getch();
      return 0;
   }
