   /* Демонстрация:                                          */
   /*                                                        */
   /*  (1) интерполяционного поиска индекса  заданного  эле- */
   /*      мента одномерного числового  массива, упорядочен- */
   /*      ного по возрастанию                               */
   /*      (н е р е к у р с и в н ы й  вариант);             */
   /*                                                        */
   /*  (2) определение времени выполнения программы          */
   /* ------------------------------------------------------ */
   #include<stdio.h>
   #include<stdlib.h>
   #include<time.h>
   #include<conio.h>
   #define N 150           /* Количество элементов в массиве */
      int intSearch(int *,int,int);
      void bubbleSort(int *);
      void obmen(int *,int *);
  /* ----------------------- */
   int main()
   {
      int a[N],  /* Исходный массив */
     i,     /* Параметр циклов */
     x;     /* Искомый элемент */
      clock_t start,end;
      /* ----------------------------------------------- */
      printf("Заполнение массива случайными числами...\n");
      srand(time(NULL));
      for (i=0;i<N;i++)
   a[i]=rand()%10;
      /* ----------------------------- */
      /* Сортировка введённого массива */
      /* ----------------------------- */
      bubbleSort(a);
      /* ------------------------- */
      /* Контрольный вывод массива */
      /* ------------------------- */
      printf("Введённый массив: ");
      for (i=0; i<N; i++)
         printf("%u ",a[i]);
      /* ---------------------------------------- */
      printf("\nИскомый элемент: "); scanf("%u",&x);
      start=clock();
      i=intSearch(a,N,x);
      end=clock();
      printf("Время работы программы: %6.6f сек\n",
        (double)(end-start)/(double)CLOCKS_PER_SEC);
      if (i!=-1)
      {
        printf("Элемент найден. Один из его номеров: %u\n",i);
        int j=i;
        while (a[i]==a[--i]);
        while (a[j]==a[++j]);
        printf("Диапазон индексов искомого элемента: (%d,%d)\n",
               ++i,--j);
      }
      else printf("Элемент не найден.\n");
      getch();
      return 0;
   }
   /* ---------------------------- */
   int intSearch (int *a,int n,int d)
   /* Функция возвращает результат интерполяционного поиска */
   /* заданного элемента в упорядоченном массиве:           */
   /*  a - указатель на массив, n - размер массива,         */
   /*  d - искомый элемент                                  */
   /* ----------------------------------------------------- */
   {
      int index=-1,      /* Индекс при неудачном поиске         */
          low=0,upp=n-1, /* Индексы нижней и верхней границы    */
                         /* диапазона поиска                    */
          divI;          /* Индекс разбиения текущего интервала */
      do
      {
        divI=low;       
        if (a[upp]!=a[low])
          divI=low+(upp-low)*(d-a[low])/(a[upp]-a[low]);
        else if (a[low]!=d)
               break;
        if (a[divI]>d) /* Определение нового диапазона поиска */
          upp=divI;
        else if (a[divI]<d)
               low=divI;
             else /* Искомый элемент оказался в точке разбиения */
             {
               index=divI; break;
             }
      }
      while (upp-low>1);
      return index;
   }
  /* ------------------- */
   void bubbleSort(int *p)
   /* Сортировка методом простого обмена */
   /* ---------------------------------- */
   {
      int i,j;
      for (i=0;i<N;i++)
        for (j=N-1;j>i;j--)
          if (p[j-1]>p[j])
            obmen(&p[j-1],&p[j]);
   }
  /* --------------------- */
   void obmen(int *x,int *y)
   {
      int klad=*x;
      /* --------- */
      *x=*y; *y=klad;
   }
