   /* Демонстрация однопроходного алгоритма определения */
   /* трёх самых больших элементов одномерного массива. */
   /* Массив состоит  из  псевдослучайных  целых чисел, */
   /* равномерно распределенных на [a,b]                */
   /* ------------------------------------------------- */
   #include<stdio.h>
   #include<stdlib.h>
   #include<conio.h>
   #include<time.h>
   #define N 16       /* Количество элементов в массиве */
   /* ------------------------------------------------- */
     void sortInsert (int *);
     void print (int *);
   /* --------------- */
   int main()
   {
      int d[N],           /* Исходный массив            */
	  a,              /* Нижняя граница диапазона   */
	  b,              /* Верхняя граница диапазона  */
	  i,              /* Параметр цикла             */
	  u,v,w;          /* Вспомогательные переменные */
      /* ---------------------------------------------- */
      printf("Введите нижнюю границу : "); scanf("%u",&a);
      printf("Введите верхнюю границу: "); scanf("%u",&b);
      srand(time(NULL));
      printf("\"Случайный\" массив:\n");
      for (i=0;i<N;i++)
	printf("%u ",d[i]=a+rand()%(b-a+1));
      printf("\n\n");
      /* --------- */
      u=0; v=0; w=0;
      for (i=1;i<N;i++)
	if (d[i]==u||d[i]==v||d[i]==w)
	  ;
	else if (d[i]>w)
	     {
	       u=v; v=w; w=d[i];
	     }
	     else if (d[i]>v&&d[i]<w)
		  {
		    u=v; v=d[i];
		  }
		  else if (d[i]>u&&d[i]<v)
			 u=d[i];
      printf("Результат: %d %d %d\n",u,v,w);
      /* -------------------------------- */
      /* Проверка полученного результата  */
      /* -------------------------------- */
      sortInsert(d);
      printf("Проверка : "); print(d);
      /* -------------------------- */
      getch();
      return 0;
   }
   /* ------------------------------- */
   /* Сортировка простыми включениями */
   /* ------------------------------- */
   void sortInsert (int *p)
   {
     int i,j,x;
     for (i=1;i<N;i++)
     {
       x=p[i];
       for (j=i-1; j>=0 && x<p[j]; j--)
         p[j+1]=p[j];
       p[j+1]=x;
     }
   }
   /* ----------------------- */
   /* Вывод элементов массива */
   /* ----------------------- */
   void print (int *p)
   {
     int i;
     for (i=0;i<N;i++)
       printf("%d ",p[i]);
     printf("\n\n");
   }
