   /* Демонстрация рекурсивной реализации  метода */
   /* дихотомии для решения уравнения  f(x)=0  на */
   /* отрезке [a,b] с абсолютной погрешностью e   */
   /* ------------------------------------------- */
   #include<stdio.h>
   #include<math.h>
   #include<conio.h>
      double Dihotomia (double,double,double);
      double f (double);
   /* --------------- */
   int main()
   {
      double a,b,e;
      /* --------------------------------------- */
      printf("Введите концы отрезка [a,b]     : ");
      scanf("%lf %lf",&a,&b);
      printf("Введите точность вычислений     : ");
      scanf("%lf",&e);
      printf("Корень уравнения                : %lf\n",
	      Dihotomia(a,b,e));
      printf("Верификация (сравнение f(x) с e): %lf\n",
	      fabs(f(Dihotomia(a,b,e))-e));
      getch();
      return 0;
   }

   /* --------------------------------------------------- */
   /* Функция возвращает приближение  к  корню  уравнения */
   /* f(x)=0 на отрезке [a,b] с абсолютной погрешностью e */
   /* --------------------------------------------------- */
   double Dihotomia (double a,double b,double e)
   {
     if (fabs(b-a)>e)
       if (f(a)*f((a+b)/2.0)>0)
         return Dihotomia((a+b)/2.0,b,e);
       else return Dihotomia(a,(a+b)/2.0,e);
     else return (a+b)/2.0;
   }

   /* ---------------------------------- */
   /* Вычисление значения функции y=f(x) */
   /* ---------------------------------- */
   double f (double x)
   {
     return // 2*pow(0.5,x)-1.0;
            // 2*pow(1.0/3.0,x)+3.0/2.0*pow(1.0/4.0,x)
            //                 +5*pow(1.0/2.0,x)-1.0;
            // 2*pow(1.0/5.0,x)+pow(1.0/6.0,x)-1.0;
            // 4.0/3.0*pow(1.0/2.0,x)+3.0*pow(1.0/3.0,x)
            //        +16.0/3.0*pow(1.0/4.0,x)-1.0;
            // 3.0/4.0*pow(1.0/2.0,x)+pow(1.0/3.0,x)
            //        +pow(1.0/6.0,x)+pow(1.0/8.0,x)-1.0;
            // ------------------------------------------
            // 2.0*pow(1.0/6.0,x)+3.0*pow(1.0/3.0,x)
            //        +7.0*pow(1.0/2.0,x)+4.0*pow(3.0/4.0,x)-1.0;
            // pow(1.0/1000.0,x)+pow(999.0/1000.0,x)-1.0;
               pow(1.0/5.0,x)+pow(7.0/10.0,x)-1.0;
   }
