   -- Демонстрация сортировки  п о д с ч ё т о м  по воз-
   -- растанию элементов целочисленного списка ls.
   -- При этом известно, что массив содержит целые числа,
   -- принадлежащие отрезку [minimum ls, maximum ls]
   -- **********************************************
   import List

   -- *********************************
   -- Функция конструирует список вида:
   --
   -- [(x ,k ),(x ,k ),...,(x ,k )],
   --    1  1    2  2        r  r  
   --
   -- где k ,k ,...,k  - число вхождений в список x ,x ,...,x
   --      1  2      r                             1  2      r
   -- соответственно
   ------------------------------------------------------
   abc ls = map (\x -> (x,length (findIndices (==x) ls))) 
                [minimum ls..maximum ls]

   -- *************************************************
   -- Функция возвращает результат сортировки подсчётом
   -- списка ls
   -----------------------------------------------
   res ls = concat $ map (\(x,k) -> replicate k x) 
                         (abc ls)

   -- ***************************
   -- Неудачные тестовые примеры:
   -------------------------------------------
   test1 = res [3,2,4,5,3,5,2,6,4,2,2,2,3,2,4]
   test2 = res [1000,999..1]
   test3 = res [2]
