   /* Демонстрация сортировки методом простого обмена */
   /* (первый способ)                                 */
   /* ----------------------------------------------- */
   #include<stdio.h>
   #include<stdlib.h>
   #include<conio.h>
   #include<time.h>
   #define N 5        /* Количество элементов в массиве */
      void bubbleSort1 (int *);
      void obmen (int *,int *);
      void print (int *);
   /* ---------------- */
   int main()
   {
      int i,a[N];
      /* ------------------------------------- */
      printf("Введите: 0 - \"случайный\" массив,"
             " 1 - ввод массива с клавиатуры: ");
      scanf("%d",&i);
      if (i)
      {
        /* Ввод массива с клавиатуры */
        printf("Введите массив из %u элементов:\n",N);
        for (i=0; i<N; i++)
          scanf("%d",&a[i]);
      }
      else {
             /* Случайный ввод массива */
             srand(time(NULL));
             for (i=0; i<N; i++)
               a[i]=rand()%10;
           }
      printf("Контрольный вывод исходного массива: "); print(a);
      printf("Пошаговая демонстрация сортировки методом\n"
             "простого обмена (первый способ):\n");
      bubbleSort1(a);
      printf("Результат: "); print(a);
      getch();
      return 0;
   }
   /* ---------------------------------- */
   /* Сортировка методом простого обмена */
   /* (первый вариант)                   */
   /* ---------------------------------- */
   void bubbleSort1 (int *p)
   {
      int i,j;
      for (i=0; i<N; i++)
        for (j=N-1; j>i; j--)
          if (p[j-1]>p[j])
          {
            obmen(&p[j-1],&p[j]); print(p);
          }
   }
  /* --------------------- */
   void obmen(int *x,int *y)
   {
      int klad=*x;
      *x=*y; *y=klad;
   }
   /* ----------------------- */
   /* Вывод элементов массива */
   /* ----------------------- */
   void print (int *p)
   {
      int i;
      for (i=0; i<N; i++)
        printf("%d ",p[i]);
      printf("\n");
   }
