   /* Демонстрация сортировки методом простого обмена */
   /* (второй способ)                                 */
   /* ----------------------------------------------- */
   #include<stdio.h>
   #include<stdlib.h>
   #include<conio.h>
   #include<time.h>
   #define N 5      /* Количество элементов в массиве */
      int f;
      void bubbleSort2(int *);
      void obmen(int *,int *);
      void print(int *);
   /* --------------- */
   int main()
   {
      int i,a[N];
      /* ------------------------------------- */
      printf("Введите: 0 - \"случайный\" массив,"
             " 1 - ввод массива с клавиатуры: ");
      scanf("%d",&i);
      if (i)
      {
        printf("Введите массив из %u элементов:\n",N);
        for (i=0; i<N; i++)
          scanf("%d",&a[i]);
      }
      else {
             srand(time(NULL));
             for (i=0; i<N; i++)
               a[i]=rand()%10;
           }
      printf("Контрольный вывод исходного массива: "); print(a);
      printf("Пошаговая демонстрация сортировки методом\n"
             "простого обмена (второй способ):\n");
      bubbleSort2(a);
      printf("Результат: "); print(a);
      getch();
      return 0;
   }
   /* ---------------------------------- */
   /* Сортировка методом простого обмена */
   /* (второй вариант)                   */
   /* ---------------------------------- */
   void bubbleSort2 (int *p)
   {
      int i,j; /* Параметры циклов                    */
               /* Если был обмен, то f=1, иначе - f=0 */
      for (f=1,i=0; i<N&&f; i++)
        for (f=0,j=N-1; j>i; j--)
          if (p[j-1]>p[j])
          {
            f=1; obmen(&p[j-1],&p[j]); print(p);
          }
   }
  /* --------------------- */
   void obmen(int *x,int *y)
   {
      int klad=*x;
      *x=*y; *y=klad;
   }
   /* ----------------------- */
   /* Вывод элементов массива */
   /* ----------------------- */
   void print (int *p)
   {
      int i;
      for (i=0; i<N; i++)
        printf("%d ",p[i]);
      printf("\nf = %d",f);
      printf("\n\n");
   }
