   /* Демонстрация рекурсивной реализации алгоритма */
   /* быстрой сортировки                            */
   /* --------------------------------------------- */
   #include<stdio.h>
   #include<stdlib.h>
   #include<conio.h>
   #include<time.h>
   #define N 7     /* Количество элементов массива */
      void Sort(int,int,int *);
  /* ------------------------ */
   int main()
   {
      int i,a[N+1];
      clock_t start,end;
      /* ------------------------------------------------ */
      printf("Введите натуральное число: "); scanf("%u",&i);
      srand(i?i:time(NULL));
      /* ------------------------------- */
      /* Ввод "псевдослучайного" массива */
      /* ------------------------------- */
      for (i=1;i<=N;i++)
	scanf("%d",&a[i]);
	// a[i]=rand()%10;
      /* ------------------------- */
      /* Контрольный вывод массива */
      /* ------------------------- */
      printf("Исходный массив: ");
      for (i=1;i<=N;i++)
	printf("%2u ",a[i]);
      printf("\n");
      /* --------------------- */
      start=clock(); Sort(1,N,a);
      end=clock();
      /* ---------------------- */
      printf("Результат      : ");
      for (i=1;i<=N;i++)
	printf("%2d ",a[i]);
      printf("\n");
      /* --------------------------------- */
      printf("Время сортировки: %6.8f сек\n",
	     (double)(end-start)/(double)CLOCKS_PER_SEC);
      printf("\n");
      getch();
      return 0;
   }
  /* ------------------------- */
   void Sort(int l,int r,int *p)
   /* Быстрая сортировка (по Ч.Хоару) */
   /* ------------------------------- */
   {
      int i=l,           // Индекс первого элемента массива p
          j=r,           // Индекс последнего элемента массива p
          x=p[(l+r)/2],  // Значение "серединного" элемента
          w;             // Вспомогательная переменная
      /* ------------------------------------------ */
      for (unsigned k=1; k<=N; k++)
	printf("%2u ",p[k]);
      printf("\n");
      do
      {
        while (p[i]<x)
          i++;
        while (x<p[j])
          j--;
        if (i<=j)
        {
          w=p[i]; p[i]=p[j]; p[j]=w; i++; j--;
        }
      } while (i<=j);
      if (l<j)
        Sort(l,j,p);
      if (i<r)
        Sort(i,r,p);
   }
