   /* Демонстрация сортировки бинарными включениями */
   /* --------------------------------------------- */
   #include<stdio.h>
   #include<stdlib.h>
   #include<conio.h>
   #include<time.h>
   #define N 9                /* Количество элементов в массиве */
     void sortBinInsert (int *);
     void print (int *);
  /* ----------------- */
   int main()
   {
      int i,a[N];
      printf("Введите: 0 - \"случайный\" массив,"
             " 1 - ввод массива с клавиатуры: ");
      scanf("%d",&i);
      if (i)
      {
        printf("Введите массив из %u элементов:\n",N);
        for (i=0;i<N;i++)
          scanf("%d",&a[i]);
      }
      else {
             srand(time(NULL));
             for (i=0;i<N;i++)
               a[i]=rand()%10;
           }
      printf("Исходный массив: "); print(a);
      printf("Пошаговая демонстрация сортировки "
             "бинарными включениями:\n");
      sortBinInsert(a);
      printf("\nРезультат: "); print(a);
      getch();
      return 0;
   }
  /* ----------------------- */
   void sortBinInsert (int *p)
   /* Сортировка бинарными включениями */
   /* -------------------------------- */
   {
      int i,j,   /* Параметры циклов                  */
          x,     /* Вспомогательная переменная        */
          m,     /* "Середина" промежутка             */
          l,r;   /* Левая и правая границы промежутка */
      /* -------------------------------------------- */
      for (i=1;i<N;i++)
      {
        x=p[i]; l=0; r=i-1;
        while (l<=r)
          if (x<p[m=(l+r)/2])
            r=m-1;
          else l=m+1;
        for (j=i-1;j>=l;j--)
          p[j+1]=p[j];
        p[l]=x;
        print(p);
      }
   }
  /* --------------- */
   void print (int *p)
   /* Вывод элементов массива на экран */
   /* -------------------------------- */
   {
      int i;
      /* ----------- */
      for (i=0;i<N;i++)
        printf("%d ",p[i]);
      printf("\n");
   }
