   /* Демонстрация бинарного поиска наименьшего индекса */
   /* заданного элемента одномерного числового массива, */
   /* строго упорядоченного по возрастанию              */
   /* (н е р е к у р с и в н ы й  вариант)              */
   /* ------------------------------------------------- */
   #include<stdio.h>
   #include<conio.h>
   #define N 7       /* Количество элементов в массиве  */
  /* -------------------------------------------------- */
   int main()
   {
      unsigned a[N],  /* Исходный массив                */
               x,     /* Искомый элемент                */
               i,j,k, /* Параметры циклов               */
               p=0;   /* Результат поиска элемента      */
      /* ---------------------------------------------- */
      printf("Введите массив из %u элементов, ",N);
      printf("упорядоченный по возрастанию:\n");
      for (i=0;i<N;i++)
        scanf("%u",&a[i]);
      printf("Введённый массив: ");
      for (i=0;i<N;i++)
        printf("%u ",a[i]);
      printf("\nИскомый элемент: "); scanf("%u",&x);
      i=0; j=N-1;
      do
      {
        k=(i+j)/2;
        if (a[k]==x)
          p=1;
        else if (a[k]<x)
               i=k+1;
             else j=k-1;
      } while (!p && i<=j);
      if (p)
        printf("Элемент найден; его номер - %u\n",k);
      else printf("Элемент не найден.\n");
      getch();
      return 0;
   }
