   /* Демонстрация:                                          */
   /*                                                        */
   /*  (1) бинарного поиска индекса заданного элемента одно- */
   /*      мерного числового массива, упорядоченного по воз- */
   /*      растанию (рекурсивный вариант);                   */
   /*                                                        */
   /*  (2) определение времени выполнения программы          */
   /* ------------------------------------------------------ */
   #include<stdio.h>
   #include<stdlib.h>
   #include<time.h>
   #include<conio.h>
   #define N 100         /* Количество элементов в массиве */
      int binSearch(int *,int,int,int);
      void bubbleSort(int *);
      void obmen(int *,int *);
  /* ----------------------- */
   int main()
   {
      int a[N],          /* Исходный массив */
          i,             /* Параметр циклов */
          x;             /* Искомый элемент */
      clock_t start,end;
      /* ----------------------------------------------- */
      printf("Заполнение массива случайными числами...\n");
      srand(time(NULL));
      for (i=0;i<N;i++)
        a[i]=rand()%10;
      /* ----------------------------- */
      /* Сортировка введённого массива */
      /* ----------------------------- */
      bubbleSort(a);
      /* ------------------------- */
      /* Контрольный вывод массива */
      /* ------------------------- */
      printf("Введённый массив: ");
      for (i=0;i<N;i++)
        printf("%u ",a[i]);
      /* ---------------------------------------- */
      printf("\nИскомый элемент: "); scanf("%u",&x);
      start=clock();
      i=binSearch(a,0,N-1,x);
      end=clock();
      printf("Время работы программы: %6.6f сек\n",
                  (double)(end-start)/(double)CLOCKS_PER_SEC);
      if (i!=-1)
      {
        printf("Элемент найден; один из его номеров: %u\n",i);
        int j=i;
        while (a[i]==a[--i]);
        while (a[j]==a[++j]);
        printf("Диапазон индексов искомого элемента: (%d,%d)\n",
               ++i,--j);
      }
      else printf("Элемент не найден.\n");
      getch();
      return 0;
   }
  /* ------------------------------------------ */
   int binSearch(int *arr,int low,int high,int y)
   {
      int mid;      /* "Средний" индекс элементов массива */
      /* ------------------------------------------------ */
      if (low>high)
        return -1;
      else if (y==*(arr+(mid=(low+high)/2)))
             return mid;
           else if (y<*(arr+mid))
                  return binSearch(arr,low,mid-1,y);
                else return binSearch(arr,mid+1,high,y);
   }
  /* ------------------- */
   void bubbleSort(int *p)
   /* Сортировка методом простого обмена */
   /* ---------------------------------- */
   {
      int i,j;
      for (i=0;i<N;i++)
        for (j=N-1;j>i;j--)
          if (p[j-1]>p[j])
            obmen(&p[j-1],&p[j]);
   }
  /* --------------------- */
   void obmen(int *x,int *y)
   {
      int klad=*x;
      /* --------- */
      *x=*y; *y=klad;
   }
