   { Демонстрация определения наибольшего числа элементов }
   { одномерного целочисленного массива  А[1..20], распо- }
   { ложенных  в виде "пилы" зубьями вверх, т.е. удовлет- }
   { воряющих соотношению:                                }
   {                                                      }
   {   А[1]<A[2]>A[3]<A[4]>...<A[k-1]>A[k].               }
   {                                                      }
   { Используется однопроходной алгоритм.                 }
   { ---------------------------------------------------- }
   {                Пояснение к решению                   }
   { Любой элемент таблицы можно рассматривать в качестве }
   { начала "пилы". Между элементами, образующими "пилу", }
   { должны выполняться соотношения:                      }
   {                                                      }
   {   при k=1: а[1]<a[2] или -a[1]>-a[2],                }
   {   при k=2: а[2]>a[3],                                }
   {   при k=3: а[3]<a[4] или -a[3]>-a[4],                }
   {   при k=4: a[4]>a[5].                                }
   {                                                      }
   {                     k            k                   }
   { В общем случае: (-1) *a[i] > (-1) *a[i+1].           }
   { Так как элементы берутся  парами (a[i] и a[i+1]), то }
   { перебирать элементы следует, начиная с первого номе- }
   { ра по девятнадцатый.                                 }
   {                                                      }
   {   Авторы: Денисова О.П., Шатских М.В. (1990)         }
   { ---------------------------------------------------- }
   PROGRAM Primer_5;
      Uses CRT;
      var i,k,KMAX: Integer;
          a       : Array [1..20] of Integer;
  { ---------------------------------------- }
   FUNCTION x(k: Integer): Integer;
   BEGIN
      If Odd(k)=FALSE
        then x:=1
        else x:=-1
   END;
  { --- }
   BEGIN
      Randomize;
      k:=1; KMAX:=1;
      For i:=1 to 8 do
        begin a[i]:=Random(10); Write(a[i]:2,' ') end;
      WriteLn;
      For i:=1 to 9 do
        begin
          If x(k)*a[i]>x(k)*a[i+1]
            then begin
                   k:=k+1;
                   If k>KMAX
                     then KMAX:=k
                 end
            else If a[i]<a[i+1]
                   then k:=2
                   else k:=1
        end;
      WriteLn; WriteLn('Результат: ',KMAX); WriteLn;
      ReadKey
   END.
   -------------------------------------------------
   Тестирование. Числа выбираются случайным образом:

   3 8 5 15 9 18 13 14 18 3 17 2 7 16 0 11 7 4 15 19
   8
   19 17 6 8 2 8 17 6 14 12 15 2 8 6 8 4 7 18 14 4
   12
   13 15 15 1 19 18 19 0 8 7 3 4 1 17 19 2 18 9 3 6
   7
