   /* Демонстрация моделирования обнаружения  б е с к о - */
   /* н е ч н о г о  предела функции y=f(x)  при x, стре- */
   /* мящемся к конечной предельной точке.                */
   /*                                                     */
   /* Автор: М.В.Швецкий (18.04.2013)                     */
   /* --------------------------------------------------- */
   #include<stdio.h>
   #include<math.h>
   #include<conio.h>
      double f (double);
   /* --------------- */
   int main()
   {
      double x0,x1,
             delta=0.1,
             M=10000;
      /* ------------------------------------------------- */
      printf("Введите предельную точку: "); scanf("%lg",&x0);
      x1=x0-delta;
      while (fabs(f(x1))<M)
      {
        delta=delta/2; x1=x0-delta;
        printf("(%7g,%7g)\n",x1,f(x1));
      }
      printf("Результат: %g\n",f(x1));
      getch();
      return 0;
   }
   /* ------------- */
   double f (double x)
   {
      return (x-1.0)/(x*x-2.0*x+1.1);
   }
