   /* Демонстрация моделирования функции, вычисляющей */
   /* к о н е ч н ы й  предел вида                    */
   /*                                                 */
   /*     lim     f(x)=b                              */
   /*  x->infinity                                    */
   /*                                                 */
   /* Автор: М.В.Швецкий (26.05.2013)                 */
   /* ----------------------------------------------- */
   #include<stdio.h>
   #include<math.h>
   #include<conio.h>
   /* --------------- */
      double f (double);
   int main()
   {
      double x1,x2,
	     h=1.0,         /* Расстояние между точками x1 и x2 */
	     eps=0.0000001; /* Погрешность нахождения предела   */
      /* ------------------------------------------------------ */
      printf("Точка из области определения функции f=f(x): ");
      scanf("%lf",&x1);
      x2=x1+h;
      while (fabs(f(x1)-f(x2))>eps)
      {
	x1*=2.0; x2*=2.0;
      }
      printf("Результат вычисления предела: %lf\n",
	     (f(x1)+f(x2))/2.0);
   // printf("Проверка                    : %f\n",M_PI/2);
      printf("Проверка                    : %lf\n",1.0);
      getch();
      return 0;
   }
   /* ------------- */
   double f (double x)
   {
     // return atan(x);
     // return pow(x,1.0/x);
     // return (sqrt(x)-sqrt(x-1.0)) * log(1+2.0/x)
     //				   / pow(1.0/x,3.0/2.0);
     // return sqrt(1/x+1/sqrt(x)) / pow(1.0/x,1.0/4.0);
        return (1.0-cos(x))/x;
     // ------------------------
     // Удачный тестовый пример:
     // --------------------------------------------------------------
     // return (1.0-cosl(x)) * powl(x,0.33333) / (sqrtl(2.0*x+1.0)-1);
   }
