   { Бинарный поиск наименьшего индекса заданного эле- }
   { мента одномерного "случайного" числового массива, }
   { строго упорядоченного по возрастанию              }
   { (нерекурсивный вариант)                           }
   { ------------------------------------------------- }
   PROGRAM Find_3;
      uses  CRT;
      const N=8;            { Количество элементов в массиве    }
      var  i,j,k: Integer;  { Параметры циклов                  }
           Q    : Boolean;  { Флаг - результат поиска элемента  }
           A    : Array [1..N] of Integer;
                            { Исходный массив, упорядоченный по }
                            { по возрастанию                    }
           X    : Integer;  { Искомый элемент                   }
           c    : Char;
   BEGIN
      WriteLn('Массив должен быть строго упорядочен по возрастанию.');
      Write('Вводите элементы массива: ');
      For i:=1 to N do
         Read(A[i]);
      Write('Введенный массив: ');
      For i:=1 to N do
         Write(A[i],' ');
      WriteLn;
      Write('Искомый элемент: '); Read(X);
      Q:=FALSE; i:=1; j:=N;
      Repeat
         k:=(i+j) DIV 2;
         If A[k]=X
           then Q:=TRUE
           else If A[k]<X
                  then i:=k+1
                  else j:=k-1
      until Q OR (i>j);
      WriteLn;
      If Q
        then begin
               Write('Элемент найден; его минимальный ');
               WriteLn('индекс в массиве: ',k)
             end
        else WriteLn('Элемент не найден.');
      c:=ReadKey
   END.
