   { В массиве X каждый элемент равен 1 или 2. Переставьте }
   { элементы массива так, чтобы вначале располагались все }
   { 0, затем - все 1 и, наконец, все 2 (при этом дополни- }
   { тельный массив не использовать)                       }
   { ----------------------------------------------------- }
   PROGRAM v15;
      Uses CRT;
      var m,
          n0,n1,n2,
          i: Integer; 
          x: Array [1..8] of 0..2;
   BEGIN
     n0:=0; n1:=0; n2:=0;
     Write('Введите m: '); Read(m);
     for i:=1 to m do
       Read(x[i]);
     For i:=1 to m do
       Case x[i] of
         0: n0:=n0 + 1;
         1: n1:=n1 + 1;
         2: n2:=n2 + 1
       end;
     For i:=1 to n0 do
       x[i]:=0;
     For i:=n0+1 to n0+n1 do
       x[i]:=1;
     For i:=n0+n1+1 to m do
       x[i]:=2;
     Write('Модифицированный массив: ');
     For i:=1 to m do
       Write(' ',x[i]);
     ReadKey
   END.
